In [3]:
!pip install torchsummaryX==1.1.0 wandb onnx --quiet

In [4]:
import torch
import numpy as np
from torchsummaryX import summary

In [6]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.2-cp311-cp311-macosx_11_0_arm64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.23.2 in /Users/dell/anaconda3/envs/pytorch/lib/python3.11/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/dell/anaconda3/envs/pytorch/lib/python3.11/site-packages (from pandas) (2.9.0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/dell/anaconda3/envs/pytorch/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.2-cp311-cp311-macosx_11_0_arm64.whl (11.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.3/11.3 MB 46.6 MB/s eta 0:00:00a 0:00:01
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 505.5/505.5 kB 27.3 MB/s eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 345.4/345.4 kB 25.9 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1

In [32]:
# pandas opr review
import pandas as pd
# can read from csv data
df =pd.read_csv("small_train.csv")
df.head()

#can construct from the dict structures
data = {'Name': ['John', 'Anna', 'Peter', 'Linda'],
        'Age': [28, 24, 35, 32],
        'City': ['New York', 'Paris', 'Berlin', 'London']}
# s= pd.Series([1,1,2])
df = pd.DataFrame(data)
df.head()

    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [ ]:
# info 
df.info()
df.describe()

In [31]:
#select data
#select column by name
df["Name"]
# by location(column-name)
df.loc[0:2,"Name"]

# by index (column -index)
df.iloc[0:2,2]

0    New York
1       Paris
Name: City, dtype: object

In [34]:
#screening data
df[(df["Name"] is not None)&(df["Age"]>30)]

    Name  Age    City
2  Peter   35  Berlin
3  Linda   32  London

In [74]:
#update value

df.at[0,"Name"]= None
df.head()

    Name  Age      City
0   None   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [71]:
#drop value
df.drop(["Name"],axis=1)  #column
# inplace=True , will modify on df  .default to be false. 
df.drop(1,axis=0)  #row

    Name  Age      City
0    NaN   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [81]:

#detect na
df[["Name","Age"]].isna()
df.isna().sum()

# fill na
df.fillna(0,inplace=True)
df.fillna(method="bfill",inplace=True)
# df.head()

#drop na
df.dropna(inplace=True)  #row
df.dropna(axis = 1,inplace=True)  #column
df.head()

/var/folders/xv/tp46wlm94zz0n3x9szns5pjr0000gn/T/ipykernel_15192/3289010553.py:7: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill",inplace=True)

    Name  Age      City
0      0   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [101]:
# append a new row
df.loc[4] = {'Name': 'bob', 'Age': 34, 'City': 'London'}
df.loc[3] = {'Name': 'Linda', 'Age': 32, 'City': 'London'}
#or concat
# must convert to series first
new_row =  pd.Series({'Name': 'bob', 'Age': 34, 'City': 'London'})
df = pd.concat([df, new_row], ignore_index=True)

In [103]:
# groupby function
df_g = df.groupby('City') # Group by City and calculate mean
print(df_g.sum())

              Name   Age  0
City
Berlin       Peter  35.0  0
London    Lindabob  66.0  0
New York         0  28.0  0
Paris         Anna  24.0  0

In [ ]:
df.sort_values('Age', ascending=False, inplace=True)  # Sort by Age descending

In [ ]:
df['AgeSquared'] = df['Age'].apply(lambda x: x ** 2)

In [20]:
dict ={"hello":1,"sy":2}
list(dict.items())[0]
print(type(dict.items()))

<class 'dict_items'>

In [6]:
# class inheritance
class Student():
    def __init__(self,school):
        self.school = school
        print( "I am a student")
class CMUstudent(Student):
    def __init__(self,name,school):
        super().__init__(school)
        self.name =name
        print(f"{name} is studying at {school}")

s = CMUstudent("bob","cmu")

I am a student
bob is studying at cmu

In [8]:
class simple_data_loader():
    def __init__(self,dataset):
        self.dataset = dataset
        print(f"length of dataset : {len(self.dataset)}")
    def get_batch(self,batch_size):
        self.batch_size = batch_size
        for i in range(0, len(self.dataset), self.batch_size):  #step is batch size
            yield self.dataset[i:i+self.batch_size]
dataset = [i for i in range(1, 21)]
batches = simple_data_loader(dataset).get_batch(7)
for i ,l in enumerate(batches):
    print(f"batch {i} : {l}")

length of dataset : 20
batch 0 : [1, 2, 3, 4, 5, 6, 7]
batch 1 : [8, 9, 10, 11, 12, 13, 14]
batch 2 : [15, 16, 17, 18, 19, 20]